PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_scb_ezi2c.c
        if (_FLD2BOOL(SCB_CTRL_EC_AM_MODE, SCB_CTRL(locBase)))
        {
            /* The SCB is wakeup-capable: enable the I2C wakeup interrupt
            * source. If any transaction was paused the the EZI2C interrupt
            * becomes pending and prevents entering Deep Sleep mode.
            * The transaction continues as soon as the global interrupts
            * are enabled.
            */
            Cy_SCB_SetI2CInterruptMask(locBase, CY_SCB_I2C_INTR_WAKEUP);

            /* Disable SCB clock */
            SCB_I2C_CFG(locBase) &= (uint32_t) ~CY_SCB_I2C_CFG_CLK_ENABLE_Msk;

            /* IMPORTANT (replace line above for the CY8CKIT-062 rev-08):
            * for proper entering Deep Sleep mode the I2C clock must be disabled.
            * This code must be inserted by the user because the driver
            * does not have access to the clock.
            */
        }

        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_AFTER_TRANSITION:
    {
        if (_FLD2BOOL(SCB_CTRL_EC_AM_MODE, SCB_CTRL(locBase)))
        {
            /* Enable SCB clock */
            SCB_I2C_CFG(locBase) |= CY_SCB_I2C_CFG_CLK_ENABLE_Msk;

            /* IMPORTANT (replace line above for the CY8CKIT-062 rev-08):
            * for proper exiting Deep Sleep mode, the I2C clock must be enabled.
            * This code must be inserted by the user because the driver
            * does not have access to the clock.
            */

            /* The SCB is wakeup-capable: disable the I2C wakeup interrupt
            * source and restore slave interrupt sources.
            */
            Cy_SCB_SetI2CInterruptMask(locBase, CY_SCB_CLEAR_ALL_INTR_SRC);
            Cy_SCB_SetSlaveInterruptMask(locBase, CY_SCB_EZI2C_SLAVE_INTR);
        }
        else
        {
            /* The SCB is NOT wakeup-capable: enable the slave to operate */
            Cy_SCB_EZI2C_Enable(locBase);
        }

        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    default:
        /* Unknown state */
        break;
    }

    return (retStatus);
}


/*******************************************************************************
* Function Name: Cy_SCB_EZI2C_HibernateCallback
****************************************************************************//**
*
* This function handles the transition of the EZI2C SCB block into Hibernate
* mode. It prevents the device from entering Hibernate mode if the EZI2C slave
* is actively communicating.
* If the EZI2C is ready to enter Hibernate mode, it is disabled. If the device
* fails to enter Hibernate mode, the EZI2C is enabled. While the EZI2C
* is disabled, it stops driving the output and ignores the inputs.
* The slave NACKs all incoming addresses.
*
* This function must be called during execution of \ref Cy_SysPm_SystemEnterHibernate.
* To do this, register this function as a callback before calling
* \ref Cy_SysPm_SystemEnterHibernate : specify \ref CY_SYSPM_HIBERNATE as the callback
* type and call \ref Cy_SysPm_RegisterCallback.
*
* \param callbackParams
* The pointer to the callback parameters structure
* \ref cy_stc_syspm_callback_params_t.
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SCB_EZI2C_HibernateCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    CySCB_Type *locBase = (CySCB_Type *) callbackParams->base;
    cy_stc_scb_ezi2c_context_t *locContext = (cy_stc_scb_ezi2c_context_t *) callbackParams->context;

    cy_en_syspm_status_t retStatus = CY_SYSPM_FAIL;

    switch (mode)
    {
    case CY_SYSPM_CHECK_READY:
    {
        /* Disable the slave interrupt sources to protect the state */
        Cy_SCB_SetSlaveInterruptMask(locBase, CY_SCB_CLEAR_ALL_INTR_SRC);

        /* If the EZI2C is in the IDLE state, it is ready for Hibernate mode.
        * Otherwise, returns fail and restores the slave interrupt sources.
        */
        if (CY_SCB_EZI2C_STATE_IDLE == locContext->state)
        {
            /* Disable the EZI2C. It stops responding to the master until
            * the EZI2C is enabled. This happens if the device fails to
            * enter Hibernate mode.
            */
            Cy_SCB_EZI2C_Disable(locBase, locContext);

            retStatus = CY_SYSPM_SUCCESS;
        }

        /* Restore the slave interrupt sources */
        Cy_SCB_SetSlaveInterruptMask(locBase, CY_SCB_EZI2C_SLAVE_INTR);
    }
    break;

    case CY_SYSPM_CHECK_FAIL:
    {
        /* The other driver is not ready for Hibernate mode. Restore the
        * Active mode configuration.
        */

        /* Enable the slave to operate */
        Cy_SCB_EZI2C_Enable(locBase);

        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_BEFORE_TRANSITION:
    case CY_SYSPM_AFTER_TRANSITION:
    {
        /* The SCB is not capable of waking up from Hibernate mode: do nothing */
        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    default:
        /* Unknown state */
        break;
    }

    return (retStatus);
}


/*******************************************************************************
* Function Name: Cy_SCB_EZI2C_GetActivity
****************************************************************************//**
*
* Returns a non-zero value if an I2C Read or Write cycle has occurred since the
* last time this function was called. All flags are reset to zero at the end of
* this function call, except the \ref CY_SCB_EZI2C_STATUS_BUSY.
*
* \param base
* The pointer to the EZI2C SCB instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_scb_ezi2c_context_t
* allocated by the user. The structure is used during the EZI2C operation for
* internal configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref group_scb_ezi2c_macros_get_activity.
*
*******************************************************************************/
uint32_t Cy_SCB_EZI2C_GetActivity(CySCB_Type const *base, cy_stc_scb_ezi2c_context_t *context)
{
    uint32_t intrState;
    uint32_t retStatus;

    /* Suppress a compiler warning about unused variables */
    (void) base;

    intrState = Cy_SysLib_EnterCriticalSection();

    retStatus = context->status;
    context->status &= CY_SCB_EZI2C_STATUS_BUSY;

    Cy_SysLib_ExitCriticalSection(intrState);

    return (retStatus);
}


