PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_scb_ezi2c.c
                /* Store the base address to use it later */
                context->idx = baseAddr;
            }
            else
            {
                /* Restore the valid base address */
                context->idx = ((context->addr1Active) ? context->baseAddr1 : context->baseAddr2);

                /* The base address is out of range - NACK it */
                cmd = SCB_I2C_S_CMD_S_NACK_Msk;
            }

            /* Set the command to an ACK or NACK address */
            SCB_I2C_S_CMD(base) = cmd;

            if (cmd == SCB_I2C_S_CMD_S_ACK_Msk)
            {
                /* Prepare the buffer for a write */
                if (context->addr1Active)
                {
                    context->curBuf  = &context->buf1[context->baseAddr1];
                    context->bufSize = ((context->baseAddr1 < context->buf1rwBondary) ?
                                        (context->buf1rwBondary - context->baseAddr1) : (0UL));
                }
                else
                {
                    context->curBuf  = &context->buf2[context->baseAddr2];
                    context->bufSize = ((context->baseAddr2 < context->buf2rwBondary) ?
                                        (context->buf2rwBondary - context->baseAddr2) : (0UL));
                }

                /* Choice receive scheme  */
                if ((0U != context->address2) || (context->bufSize < CY_SCB_EZI2C_FIFO_SIZE))
                {
                    /* Handle each byte separately */
                    context->state = CY_SCB_EZI2C_STATE_RX_DATA0;
                }
                else
                {
                    /* Use the RX FIFO and the auto-ACK/NACK features */
                    SCB_I2C_CTRL(base) |= SCB_I2C_CTRL_S_READY_DATA_ACK_Msk;
                    UpdateRxFifoLevel(base, context->bufSize);

                    context->state = CY_SCB_EZI2C_STATE_RX_DATA1;
                }
            }
        }
    }
    break;

    case CY_SCB_EZI2C_STATE_RX_DATA0:
    {
        uint32_t byte = Cy_SCB_ReadRxFifo(base);

        /* Check whether there is space to store the byte */
        if (context->bufSize > 0UL)
        {
            /* Continue the transfer: send an ACK */
            SCB_I2C_S_CMD(base) = SCB_I2C_S_CMD_S_ACK_Msk;

            /* Store the byte in the buffer */
            context->curBuf[0UL] = (uint8_t) byte;
            context->bufSize--;
            context->curBuf++;

            /* Update the base address to notice that the buffer is modified */
            context->idx++;
        }
        else
        {
            /* Finish the transfer: send a NACK. Drop the received byte */
            SCB_I2C_S_CMD(base) = SCB_I2C_S_CMD_S_NACK_Msk;
            Cy_SCB_SetRxInterruptMask(base, CY_SCB_CLEAR_ALL_INTR_SRC);
        }
    }
    break;

    case CY_SCB_EZI2C_STATE_RX_DATA1:
    {
        /* Get the number of bytes to read from the RX FIFO */
        uint32_t numToCopy = Cy_SCB_GetRxFifoLevel(base) + 1UL;

        /* Get data from the RX FIFO */
        numToCopy = Cy_SCB_ReadArray(base, context->curBuf, numToCopy);
        context->bufSize -= numToCopy;
        context->curBuf  += numToCopy;

        /* Configure the next RX FIFO read event */
        UpdateRxFifoLevel(base, context->bufSize);

        /* Update the base address to notice that the buffer is modified */
        context->idx++;
    }
    break;

    default:
        /* Unknown state */
        break;
    }
}


/*******************************************************************************
* Function Name: HandleDataTransmit
****************************************************************************//**
*
* Loads the TX FIFO with data from the buffer.
*
* \param base
* The pointer to the EZI2C SCB instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_scb_ezi2c_context_t allocated
* by the user. The structure is used during the EZI2C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void HandleDataTransmit(CySCB_Type *base, cy_stc_scb_ezi2c_context_t *context)
{
    if (context->bufSize > 0UL)
    {
        /* Write data into the TX FIFO from the buffer */
        uint32_t numToCopy = Cy_SCB_WriteArray(base, context->curBuf, context->bufSize);
        context->bufSize  -= numToCopy;
        context->curBuf   += numToCopy;
    }

    if (0UL == context->bufSize)
    {
        /* Write the default bytes into the TX FIFO */
        (void) Cy_SCB_WriteDefaultArray(base, CY_SCB_EZI2C_DEFAULT_TX, CY_SCB_EZI2C_FIFO_SIZE);
    }
}


/*******************************************************************************
* Function Name: HandleStop
****************************************************************************//**
*
* Handles the transfer completion.
* It is triggered by a Stop or Restart condition on the bus.
*
* \param base
* The pointer to the EZI2C SCB instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_scb_ezi2c_context_t allocated
* by the user. The structure is used during the EZI2C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void HandleStop(CySCB_Type *base, cy_stc_scb_ezi2c_context_t *context)
{
    /* Check for errors */
    if (0UL != (CY_SCB_EZI2C_STATUS_ERR & context->status))
    {
        /* Re-enable the SCB to recover from errors */
        Cy_SCB_FwBlockReset(base);
    }

    /* Clean up the hardware to be ready for the next transaction */
    if (CY_SCB_EZI2C_STATE_TX_DATA == context->state)
    {
        Cy_SCB_SetTxInterruptMask(base, CY_SCB_CLEAR_ALL_INTR_SRC);
    }
    else
    {
        Cy_SCB_SetRxInterruptMask(base, CY_SCB_CLEAR_ALL_INTR_SRC);

        SCB_I2C_CTRL(base) &= (uint32_t) ~(SCB_I2C_CTRL_S_READY_DATA_ACK_Msk |
                                           SCB_I2C_CTRL_S_NOT_READY_DATA_NACK_Msk);
    }

